### Big Data Tools for Managers 
##### Dept. of MBA, Siddaganga Institute of Technology-Tumkur

<br><br>
#### Working with Titanic Dataset

The files we just opened are available on the data page for the <a href="https://www.kaggle.com/competitions/titanic" target="new">Titanic competition on Kaggle</a>. That page also has a data dictionary, which explains the various columns that make up the data set. Below are the descriptions contained in that data dictionary:


Download Dataset/ Dataset Link:
https://raw.githubusercontent.com/sitmbadept/sitmbadept.github.io/main/BDTM/R/titanic.csv

##### Note: This link take you in another page and then click on File menu -> Save Page As -> Open file window and click on Save

* **PassengerID**— A column added by Kaggle to identify each row and make sublessons easier
* **Survived**— Whether the passenger survived or not and the value we are predicting (0=No, 1=Yes)
* **Pclass**— The class of the ticket the passenger purchased (1=1st, 2=2nd, 3=3rd)
* **Name**- The name of passenger’s
* **Sex**— The passenger’s sex
* **Age**— The passenger’s age in years
* **SibSp**— The number of siblings or spouses the passenger had aboard the Titanic
* **Parch**— The number of parents or children the passenger had aboard the Titanic
* **Ticket**— The passenger’s ticket number
* **Fare**— The fare the passenger paid
* **Cabin**— The passenger’s cabin number
* **Embarked**— The port where the passenger embarked (C=Cherbourg, Q=Queenstown, S=Southampton)

<br><br><br><br><br><br><br>

### Write Python Code for below questions. ###

<ol>
    <li>Import pandas library in Python</li>
    <li>Read titanic dataset in Python</li>
    <li>Get the dimension of Titanic dataset</li>
    <li>Display column names of dataset</li>
    <li>View data</li>
    <li>Get Quick summary for all the columns</li>
    <li>Indentify the Null(Missing) values for dataset</li>
    <li>How many male and female are on Titanic?</li>
    <li>Find out maximum Ticket Fare</li>
    <li>How many passengers got survived according to dataset</li>
    <li>Count the number of Passengers based on Pclass(1=1st, 2=2nd, 3=3rd)</li>
</ol>


**Note : This analysis is based on very few variables, you may have to practice yourself with remaing variables to get more hands-on with R & Data**



<br><br><br><br>

In [1]:
# Import pandas library in Python

# !pip install pandas #Execute this statement if you don't have download & install pandas library in your laptop
import pandas as pd

In [2]:
# Read titanic dataset in Python
data = pd.read_csv("https://raw.githubusercontent.com/sitmbadept/sitmbadept.github.io/main/BDTM/R/titanic.csv")

In [3]:
# Get the dimension of Titanic dataset
data.shape

(891, 12)

In [4]:
# Display column names of dataset
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
# View data
print(data)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [6]:
# Get Quick summary for all the columns
data.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [7]:
# Indentify the Null(Missing) values for dataset
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
# How many male and female are on Titanic?
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [9]:
# Find out maximum Ticket Fare
data['Fare'].max()

512.3292

In [10]:
#How many passengers got survived according to dataset
data['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [11]:
# Count the number of Passengers based on Pclass(1=1st, 2=2nd, 3=3rd)
data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64